Revit 2027 API
RebarShapeDefinitionBySegments.NumberOfSegments Property
 The number of straight segments in this shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfSegments { get; }
Public ReadOnly Property NumberOfSegments As Integer
	Get
public:
property int NumberOfSegments {
	int get ();
}
member NumberOfSegments : int with get
Property Value
Int32
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace